api/load-test.yml
config:
  target: http://localhost:5000
  processor: "./load-test.js"
  phases:
    - arrivalCount: 60
      duration: 20
      
before:
  flow:
    - function: "generateSharedToken"

scenarios:
  - flow:
      - function: "generateVUToken"
      - log: "    shared token is: {{ sharedToken }}"
      - log: "    VU-specific token is: {{ vuToken }}"
      - get:
          headers:
            Authorization: "Bearer {{ sharedToken }}"
          url: "/api/v1/user/me"