api/load-test.yml
config:
  target: http://localhost:5000
  processor: './load-test.js'
  phases:
    - arrivalCount: 100
      duration: 60

before:
  flow:
    - function: 'generateSharedToken'

scenarios:
  - flow:
      - function: 'generateVUToken'
      - get:
          headers:
            Authorization: '{{ sharedToken }}'
          url: '/api/v1/user/users?page=1&limit=300'